Use for ETL
##Two types of pandas data structure-Series and Dataframe

1. Series-

In [2]:
import pandas as pd
df=pd.Series([1,2,3,4])
df

0    1
1    2
2    3
3    4
dtype: int64

For specify our own index

In [3]:
import pandas as pd
df=pd.Series([1,2,3,4],index=['a','b','c','d'])
df

a    1
b    2
c    3
d    4
dtype: int64

2. Dataframe

In [4]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

Using list

In [5]:
import pandas as pd
list=["Chetana","Rane","Hello"]
df=pd.DataFrame(list)
df

         0
0  Chetana
1     Rane
2    Hello

In [6]:
#Using Dictionary

data={"Over":[1,2,3,4,5],"Runs":[50,20,100,90,30]}
df=pd.DataFrame(data)
df

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

Head

In [7]:
df.head(2) #Will print first 2 rows of the dataframe

   Over  Runs
0     1    50
1     2    20

In [8]:
df.head() #Will print first 5 rows of the dataframe

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

Tail

In [9]:
df.tail() # last five lines

   Over  Runs
0     1    50
1     2    20
2     3   100
3     4    90
4     5    30

In [10]:
df.tail(3) #last 3 lines

   Over  Runs
2     3   100
3     4    90
4     5    30

Statistical Analysis

In [11]:
df.describe() #display statistical analysis

           Over        Runs
count  5.000000    5.000000
mean   3.000000   58.000000
std    1.581139   35.637059
min    1.000000   20.000000
25%    2.000000   30.000000
50%    3.000000   50.000000
75%    4.000000   90.000000
max    5.000000  100.000000

In [12]:
df.shape #shape of dataset in the form of rows*columns

(5, 2)

In [13]:
df.columns  #Indexes

Index(['Over', 'Runs'], dtype='object')

In [14]:
df.loc[2] #for accesing the particular data

Over      3
Runs    100
Name: 2, dtype: int64

In [15]:
#Example

import pandas as pd
dict={"rollno":[1,2,3,4],"name":["dd","ff","gg","hh"],"marks":[18,46,35,97]}
df=pd.DataFrame(dict)
print(df)

   rollno name  marks
0       1   dd     18
1       2   ff     46
2       3   gg     35
3       4   hh     97

In [16]:
df.shape

(4, 3)

In [17]:
df.loc[1]

rollno     2
name      ff
marks     46
Name: 1, dtype: object

In [18]:
df.loc[0:1]

   rollno name  marks
0       1   dd     18
1       2   ff     46

In [19]:
df["name"]

0    dd
1    ff
2    gg
3    hh
Name: name, dtype: object

In [20]:
df[(df["marks"]<90)]

   rollno name  marks
0       1   dd     18
1       2   ff     46
2       3   gg     35

Query Function

In [21]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],'age': [25, 30, 35, 40],'salary': [50000, 60000, 70000, 80000],'department': ['HR', 'IT', 'Finance', 'Marketing']}

df = pd.DataFrame(data)
df

      name  age  salary department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   70000    Finance
3    David   40   80000  Marketing

In [22]:
# Select rows where age is greater than 30
result = df.query('age > 30')
print(result)

      name  age  salary department
2  Charlie   35   70000    Finance
3    David   40   80000  Marketing

In [23]:
# Select rows where age is greater than 30 and salary is above 70000
result = df.query('age > 30 & salary > 70000')
print(result)

    name  age  salary department
3  David   40   80000  Marketing

In [24]:
result = df[df['name'].str.startswith('C')]
print(result)

      name  age  salary department
2  Charlie   35   70000    Finance

Unfuncs: Index Presentation

In [25]:
import pandas as pd
import numpy as np
rng=np.random.RandomState(42) # 42 for generating the same random number all the time whenever we are running it
ser=pd.Series(rng.randint(0,10,4))
print(ser)

0    6
1    3
2    7
3    4
dtype: int32

In [26]:
import pandas as pd
import numpy as np
rng=np.random.RandomState() # for generating the random number, we will get different numbers whenever we are running the code
ser=pd.Series(rng.randint(0,10,4))
print(ser)

0    2
1    7
2    0
3    9
dtype: int32

In [27]:
import pandas as pd
import numpy as np
rng=np.random.RandomState() # for generating the random number, we will get different numbers whenever we are running the code
ser=pd.Series(rng.randint(10,200,10))
print(ser)

0     28
1    123
2     89
3     52
4    158
5     72
6    150
7    125
8     91
9    194
dtype: int32

Create dataframe using randint()

In [28]:
df = pd.DataFrame(rng.randint(0,50,(3,4)),columns=['A','B','C','D'])
print(df)

    A  B   C   D
0  22  4  29  35
1  20  1  48  23
2  31  7   7  15

Aggregation

Aggregation: sum(), min(), max()
df.agg(['sum','min'])

In [29]:
s=pd.Series([12,22,34,555,6,20])
s

0     12
1     22
2     34
3    555
4      6
5     20
dtype: int64

In [30]:
sum=s.agg('sum')
print(sum)

649

In [31]:
a1=s.agg(['sum','min','max'])
a1

sum    649
min      6
max    555
dtype: int64

In [32]:
a2=s.agg(['sum','min','max','std','mean','count','var'])
a2

sum        649.000000
min          6.000000
max        555.000000
std        219.109486
mean       108.166667
count        6.000000
var      48008.966667
dtype: float64

In [33]:
data=pd.read_csv("homelessness.csv")
data.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

Grouping

In [34]:
a3=data.groupby(by=['state'])
a4=a3.first()
a4.head()

,Unnamed: 0,region,individuals,family_members,state_pop
state,,,,,
Alabama,0,East South Central,2570.0,864.0,4887681
Alaska,1,Pacific,1434.0,582.0,735139
Arizona,2,Mountain,7259.0,2606.0,7158024
Arkansas,3,West South Central,2280.0,432.0,3009733
California,4,Pacific,109008.0,20964.0,39461588

In [35]:
a3=data.groupby(by=['state'])
a4=a3.last()
a4.head()

,Unnamed: 0,region,individuals,family_members,state_pop
state,,,,,
Alabama,0,East South Central,2570.0,864.0,4887681
Alaska,1,Pacific,1434.0,582.0,735139
Arizona,2,Mountain,7259.0,2606.0,7158024
Arkansas,3,West South Central,2280.0,432.0,3009733
California,4,Pacific,109008.0,20964.0,39461588

In [36]:
a3=data.groupby(by=['state'])
a4=a3.describe()
a4.head()

           Unnamed: 0                                   individuals            \
                count mean std  min  25%  50%  75%  max       count      mean
state
Alabama           1.0  0.0 NaN  0.0  0.0  0.0  0.0  0.0         1.0    2570.0
Alaska            1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0         1.0    1434.0
Arizona           1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0         1.0    7259.0
Arkansas          1.0  3.0 NaN  3.0  3.0  3.0  3.0  3.0         1.0    2280.0
California        1.0  4.0 NaN  4.0  4.0  4.0  4.0  4.0         1.0  109008.0

            ... family_members          state_pop                              \
            ...            75%      max     count        mean std         min
state       ...
Alabama     ...          864.0    864.0       1.0   4887681.0 NaN   4887681.0
Alaska      ...          582.0    582.0       1.0    735139.0 NaN    735139.0
Arizona     ...         2606.0   2606.0       1.0   7158024.0 NaN   7158024.0
Arkansas    ...          432.0    432.0       1.0   3009733.0 NaN   3009733.0
California  ...        20964.0  20964.0       1.0  39461588.0 NaN  39461588.0


                   25%         50%         75%         max
state
Alabama      4887681.0   4887681.0   4887681.0   4887681.0
Alaska        735139.0    735139.0    735139.0    735139.0
Arizona      7158024.0   7158024.0   7158024.0   7158024.0
Arkansas     3009733.0   3009733.0   3009733.0   3009733.0
California  39461588.0  39461588.0  39461588.0  39461588.0

[5 rows x 32 columns]

In [37]:
a5=data.groupby('state').agg(['min','max'])
a5.head()

           Unnamed: 0                  region                     individuals  \
                  min max                 min                 max         min
state
Alabama             0   0  East South Central  East South Central      2570.0
Alaska              1   1             Pacific             Pacific      1434.0
Arizona             2   2            Mountain            Mountain      7259.0
Arkansas            3   3  West South Central  West South Central      2280.0
California          4   4             Pacific             Pacific    109008.0

                     family_members          state_pop
                 max            min      max       min       max
state
Alabama       2570.0          864.0    864.0   4887681   4887681
Alaska        1434.0          582.0    582.0    735139    735139
Arizona       7259.0         2606.0   2606.0   7158024   7158024
Arkansas      2280.0          432.0    432.0   3009733   3009733
California  109008.0        20964.0  20964.0  39461588  39461588

Transformation

Example 1:

In [38]:
df=pd.DataFrame({"Date": ['2015-05-08','2015-05-08','2015-05-10','2015-07-08','2015-07-08','2016-07-08'],
                 "Data":[50,7,9,120,8,4],})
print(df)
df=df.groupby('Date')['Data'].transform('sum')
print(df)

         Date  Data
0  2015-05-08    50
1  2015-05-08     7
2  2015-05-10     9
3  2015-07-08   120
4  2015-07-08     8
5  2016-07-08     4
0     57
1     57
2      9
3    128
4    128
5      4
Name: Data, dtype: int64

Example 2:

In [39]:
df=pd.DataFrame({'A':range(3),'B':range(1,4)})
print(df)

df=df.transform(lambda x:x+2)
print("\n",df)

   A  B
0  0  1
1  1  2
2  2  3

    A  B
0  2  3
1  3  4
2  4  5

Apply()

In [40]:
def calc_sum(x):
    return x.sum()
data={"x":[50,40,30],"y":[300,1112,42]}
df=pd.DataFrame(data)
x=df.apply(calc_sum)
print(x)

x     120
y    1454
dtype: int64

In [41]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['a','b','c'])
print(df)

df['d']=df.apply(lambda row: row.a+row.b+row.c,axis=1)
print(df)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9
   a  b  c   d
0  1  2  3   6
1  4  5  6  15
2  7  8  9  24

Filter()

In [42]:
#DataFrame.filter(items=None,like=None,rege x=None,axis=None)

df=pd.DataFrame(np.array(([1,2,3],[4,5,6])),index=['mouse','rabbit'],columns=['one','two','three'])
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [43]:
#select columns by name

df.filter(items=['one','three'])

        one  three
mouse     1      3
rabbit    4      6

In [44]:
#select columns by regular expressions

df.filter(regex='e$',axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [45]:
#select rows containing 'bbi'

df.filter(like='bbi',axis=0)

        one  two  three
rabbit    4    5      6

Merge()

In [ ]:
import pandas as pd

df1=pd.DataFrame({'ID':[1,2,3],'Name':['Alice','Bob','Charlie']})
df2=pd.DataFrame({'ID':[2,3,4],'Age':[25,30,35] })

#Merge dataframes on ID

merged_df=pd.merge(df1,df2,on='ID',how='inner')  #inner will take intersection

print("Merged Dataframe(using merge): ")
print(merged_df)

#Concating the two dataframes along columns

concat_df=pd.concat([df1,df2],axis=0) #axis 0 will concat vertically
print("\nConcatenated DataFrame (using concat): ")
print(concat_df)

concat_df=pd.concat([df1,df2],axis=1) #axis=1 will concat horizontally
print("\nConcatenated DataFrame (using concat): ")
print(concat_df)

Merged Dataframe(using merge):
   ID     Name  Age
0   2      Bob   25
1   3  Charlie   30

Concatenated DataFrame (using concat):
   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie   NaN
0   2      NaN  25.0
1   3      NaN  30.0
2   4      NaN  35.0

Concatenated DataFrame (using concat):
   ID     Name  ID  Age
0   1    Alice   2   25
1   2      Bob   3   30
2   3  Charlie   4   35

#Left Outer Join

In [49]:
a=pd.DataFrame()

#Creating Dictionary
d={'id':[1,2,10,12],'val1':['a','b','c','d']}

a=pd.DataFrame(d)

#Creating Dataframe b
b=pd.DataFrame()

#Creating dictionary

d={'id':[1,2,9,8],'val1':['p','q','r','s']}

b=pd.DataFrame(d)

print(a)
print(b)

#Left Outer Join
df=pd.merge(a,b,on="id",how="left")

#display dataframe

df

   id val1
0   1    a
1   2    b
2  10    c
3  12    d
   id val1
0   1    p
1   2    q
2   9    r
3   8    s

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN

#Right Outer Join

In [50]:
a=pd.DataFrame()

#Creating Dictionary
d={'id':[1,2,10,12],'val1':['a','b','c','d']}

a=pd.DataFrame(d)

#Creating Dataframe b
b=pd.DataFrame()

#Creating dictionary

d={'id':[1,2,9,8],'val1':['p','q','r','s']}

b=pd.DataFrame(d)

print(a)
print(b)

#Left Outer Join
df=pd.merge(a,b,on="id",how="right")

#display dataframe

df

   id val1
0   1    a
1   2    b
2  10    c
3  12    d
   id val1
0   1    p
1   2    q
2   9    r
3   8    s

   id val1_x val1_y
0   1      a      p
1   2      b      q
2   9    NaN      r
3   8    NaN      s

In [51]:
a=pd.DataFrame()

#Creating Dictionary
d={'id':[1,2,10,12],'val1':['a','b','c','d']}

a=pd.DataFrame(d)

#Creating Dataframe b
b=pd.DataFrame()

#Creating dictionary

d={'id':[1,2,9,8],'val1':['p','q','r','s']}

b=pd.DataFrame(d)

print(a)
print(b)

#Left Outer Join
df=pd.merge(a,b,on="id",how="inner")

#display dataframe

df

   id val1
0   1    a
1   2    b
2  10    c
3  12    d
   id val1
0   1    p
1   2    q
2   9    r
3   8    s

   id val1_x val1_y
0   1      a      p
1   2      b      q

Join

In [ ]:
data1={"name":["Sally"]}